app/Controllers/Home.php

SELECT *
FROM `users`
---
    public function index(): string
    {
        $smarty = new SmartyEngine();
        $session = session();
        $userId = (int) $session->get('user_id');
        $userRole = $session->get('user_role');
        $userModel = new UserModel();
        $user = $session->get('user') ? $userModel->find($session->get('user_id')) : null;
        $displayName = $user ? $userModel->getDisplayName($user) : $session->get('user_email');

        $pendingCount = 0;
        if (in_array($userRole, ['Manager', 'Product Lead', 'Super Admin'])) {
            $timeEntryModel = new TimeEntryModel();
            $pendingEntries = $timeEntryModel->getPendingForApprover($userId, $userRole);
            $pendingTasks = \Config\Database::connect()->table('tasks')
                ->where('status', 'Completed')->where('locked', 0)->get()->getResultArray();
            $pendingCount = count($pendingEntries) + count($pendingTasks);
        }

        $myTaskCount = 0;
        if ($userId) {
            $myTaskCount = (new TaskModel())->where('assignee_id', $userId)->countAllResults();
        }

        $data = [
            'title'          => 'Dashboard',
            'nav_active'     => 'home',
            'user_email'     => $session->get('user_email'),